<?php
/*
|-------------------------------------------------------------------------------------------
| mangophp 框架的入口文件 （explain）
|-------------------------------------------------------------------------------------------
| Auther：顾杰
*/ 
date_default_timezone_set('PRC');					//设置时区
require __DIR__ . "/../../vendor/autoload.php";		//引入自动加载文件
define('ROOT_PATH', __DIR__);						//定义根目录
define('APP_PATH', __DIR__ . "/../");               //定义项目运行目录
$app = new \Mango\Core\App();						//实例化对象
$app->run();										//启动框架
